test_new/multiphaseEuler/populationBalance/uniformGrowth/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (air1 air2 water);

referencePhase  water;

air1
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type             populationBalance;
        populationBalance bubbles;
        nGroups         15;
    }

    residualAlpha   1e-6;
}

air2
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance bubbles;
        nGroups         16;
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{}

bubbles
{
    continuousPhase water;

    sphericalDiameters
    {
        type            uniform;
        min             1.0e-3;
        max             4.0e-3;
    }

    shapeModel      spherical;

    coalescenceModel none;

    breakupModel    none;
}

// ************************************************************************* //
