test_new/multiphaseEuler/populationBalance/uniformGrowth/0/f2.air1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      f2.air1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0.0666666666667;

boundaryField
{
    boundary
    {
        type            empty;
    }
}

sources
{
    airSource
    {
        type            uniformGrowthGroupFraction;
        libs            1("libuniformGrowth.so");
    }
}


// ************************************************************************* //
