test_new/multiphaseEuler/populationBalance/uniformGrowth/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc populationBalanceSizeDistribution
(
    name=fDistribution,
    populationBalance=bubbles,
    functionType=numberDensity,
    coordinateType=volume
)

#includeFunc populationBalanceMoments
(
    populationBalance=bubbles,
    momentType=integerMoment,
    coordinateType=volume,
    order=1
)

#includeFunc populationBalanceMoments
(
    populationBalance=bubbles,
    momentType=integerMoment,
    coordinateType=volume,
    order=0
)

#includeFunc volAverage(alpha.air1)
#includeFunc volAverage(alpha.air2)

#includeFunc volAverage(integerMoment0(N,v).bubbles)

#includeFunc volAverage(integerMoment1(N,v).bubbles)

#includeFunc writeObjects(rho.air1)
#includeFunc writeObjects(rho.air2)

#includeFunc writeObjects(rho.water)

// ************************************************************************* //
