test_new/multiphaseEuler/populationBalance/uniformGrowth/system/populationBalanceSetSizeDistribution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type                populationBalanceSetSizeDistribution;
libs                ("libmultiphaseEulerFunctionObjects.so");

populationBalance   bubbles;

distribution
{
    type                multiFixedValue;
    Q                   -2;
    allowNegativeQ      yes;
    values              ${../include!initialDistribution};
}

writeControl        writeTime;

// ************************************************************************* //
